[
    {
        "poster": "poster_iron_man",
        "title": "Iron Man",
        "year": "2008",
        "details": "PG-13 | 2h 6min | Action, Adventure, Sci-Fi | ",
        "date": "2 May 2008",
        "director": "Jon Favreau",
        "stars": "Robert Downey Jr., Gwyneth Paltrow, Terrence Howard, Jeff Bridges",
        "synopsis": "Tony Stark. Genius, billionaire, playboy, philanthropist. Son of legendary inventor and weapons contractor Howard Stark. When Tony Stark is assigned to give a weapons presentation to an Iraqi unit led by Lt. Col. James Rhodes, he's given a ride on enemy lines. That ride ends badly when Stark's Humvee that he's riding in is attacked by enemy combatants. He survives - barely - with a chest full of shrapnel and a car battery attached to his heart. In order to survive he comes up with a way to miniaturize the battery and figures out that the battery can power something else. Thus Iron Man is born. He uses the primitive device to escape from the cave in Iraq. Once back home, he then begins work on perfecting the Iron Man suit. But the man who was put in charge of Stark Industries has plans of his own to take over Tony's technology for other matters.",
        "chronologicalIndex": "3",
        "phase": "One"
    },
    {
        "poster": "poster_the_incredible_hulk",
        "title": "The Incredible Hulk",
        "year": "2008",
        "details": "PG-13 | 1h 52min | Action, Adventure, Sci-Fi | ",
        "date": "13 June 2008",
        "director": "Louis Leterrier",
        "stars": "Edward Norton, Liv Tyler, Tim Roth, William Hurt",
        "synopsis": "Depicting the events after the Gamma Bomb. 'The Incredible Hulk' tells the story of Dr Bruce Banner, who seeks a cure to his unique condition, which causes him to turn into a giant green monster under emotional stress. Whilst on the run from military which seeks his capture, Banner comes close to a cure. But all is lost when a new creature emerges: The Abomination.",
        "chronologicalIndex": "4",
        "phase": "One"
    },
    {
        "poster": "poster_iron_man_2",
        "title": "Iron Man 2",
        "year": "2010",
        "details": "PG-13 | 2h 4min | Action, Adventure, Sci-Fi | ",
        "date": "7 May 2010",
        "director": "Jon Favreau",
        "stars": "Robert Downey Jr., Mickey Rourke, Don Cheadle, Gwyneth Paltrow, Scarlett Johansson",
        "synopsis": "With the world now aware of his dual life as the armored superhero Iron Man, billionaire inventor Tony Stark faces pressure from the government, the press, and the public to share his technology with the military. Unwilling to let go of his invention, Stark, along with Pepper Potts, and James \"Rhodey\" Rhodes at his side, must forge new alliances - and confront powerful enemies.",
        "chronologicalIndex": "5",
        "phase": "One"
    },
    {
        "poster": "poster_thor",
        "title": "Thor",
        "year": "2011",
        "details": "PG-13 | 1h 55min | Action, Adventure, Fantasy | ",
        "date": "6 May 2011",
        "director": "Kenneth Branagh",
        "stars": "Chris Hemsworth, Anthony Hopkins, Natalie Portman, Tom Hiddleston, Stellan Skarsgård",
        "synopsis": "The warrior Thor (Chris Hemsworth) is cast out of the fantastic realm of Asgard by his father Odin (Sir Anthony Hopkins) for his arrogance and sent to Earth to live amongst humans. Falling in love with scientist Jane Foster (Natalie Portman) teaches Thor much-needed lessons, and his new-found strength comes into play as a villain from his homeland sends dark forces toward Earth.",
        "chronologicalIndex": "6",
        "phase": "One"
    },
    {
        "poster": "poster_captain_america_the_first_avenger",
        "title": "Captain America: The First Avenger",
        "year": "2011",
        "details": "PG-13 | 2h 4min | Action, Adventure, Sci-Fi | ",
        "date": "22 July 2011",
        "director": "Joe Johnston",
        "stars": "Chris Evans, Hugo Weaving, Hayley Atwell, Sebastian Stan, Tommy Lee Jones, Samuel L. Jackson",
        "synopsis": "It is 1942, America has entered World War II, and sickly but determined Steve Rogers is frustrated at being rejected yet again for military service. Everything changes when Dr. Erskine recruits him for the secret Project Rebirth. Proving his extraordinary courage, wits and conscience, Rogers undergoes the experiment and his weak body is suddenly enhanced into the maximum human potential. When Dr. Erskine is then immediately assassinated by an agent of Nazi Germany's secret HYDRA research department (headed by Johann Schmidt, a.k.a. the Red Skull), Rogers is left as a unique man who is initially misused as a propaganda mascot; however, when his comrades need him, Rogers goes on a successful adventure that truly makes him Captain America, and his war against Schmidt begins.",
        "chronologicalIndex": "1",
        "phase": "One"
    },
    {
        "poster": "poster_the_avengers",
        "title": "The Avengers",
        "year": "2012",
        "details": "PG-13 | 2h 23min | Action, Adventure, Sci-Fi | ",
        "date": "4 May 2012",
        "director": "Joss Whedon",
        "stars": "Robert Downey Jr., Chris Evans, Chris Hemsworth, Scarlett Johansson, Mark Ruffalo, Jeremy Renner, Tom Hiddleston, Samuel L. Jackson, Clark Gregg",
        "synopsis": "Nick Fury is the director of S.H.I.E.L.D., an international peace-keeping agency. The agency is a who's who of Marvel Super Heroes, with Iron Man, The Incredible Hulk, Thor, Captain America, Hawkeye and Black Widow. When global security is threatened by Loki and his cohorts, Nick Fury and his team will need all their powers to save the world from disaster which is formed by Loki and his team.",
        "chronologicalIndex": "7",
        "phase": "One"
    },
    {
        "poster": "poster_iron_man_3",
        "title": "Iron Man 3",
        "year": "2013",
        "details": "PG-13 | 2h 10min | Action, Adventure, Sci-Fi | ",
        "date": "3 May 2013",
        "director": "Shane Black",
        "stars": "Robert Downey Jr., Guy Pearce, Don Cheadle, Gwyneth Paltrow, Ben Kingsley",
        "synopsis": "Marvel's \"Iron Man 3\" pits brash-but-brilliant industrialist Tony Stark\/Iron Man against an enemy whose reach knows no bounds. When Stark finds his personal world destroyed at his enemy's hands, he embarks on a harrowing quest to find those responsible. This journey, at every turn, will test his mettle. With his back against the wall, Stark is left to survive by his own devices, relying on his ingenuity and instincts to protect those closest to him. As he fights his way back, Stark discovers the answer to the question that has secretly haunted him: does the man make the suit or does the suit make the man?",
        "chronologicalIndex": "8",
        "phase": "Two"
    },
    {
        "poster": "poster_thor_the_dark_world",
        "title": "Thor: The Dark World",
        "year": "2013",
        "details": "PG-13 | 1h 52min | Action, Adventure, Fantasy | ",
        "date": "8 November 2013",
        "director": "Alan Taylor",
        "stars": "Chris Hemsworth, Natalie Portman, Tom Hiddleston, Anthony Hopkins, Idris Elba",
        "synopsis": "Thousands of years ago, a race of beings known as Dark Elves tried to send the universe into darkness by using a weapon known as the Aether. Warriors from Asgard stopped them, but their leader Malekith (Christopher Eccleston) escaped to wait for another opportunity. The warriors find the Aether, and since it cannot be destroyed, they try to hide it. In the present day, Jane Foster (Natalie Portman) awaits the return of Thor (Chris Hemsworth), although it has been two years since they last saw once another. In the meantime, Thor has been trying to bring peace to the nine realms. Jane discovers an anomaly similar to the one that brought Thor to Earth. She goes to investigate, finds a wormhole, and is sucked into it. Back on Asgard, Thor wishes to return to Earth, but his father, Odin (Sir Anthony Hopkins), refuses to let him. Thor learns from Heimdall (Idris Elba), who can see into all of the realms, that Jane disappeared. Thor then returns to Earth just as Jane reappears. However, when some Policemen try to arrest her, an unknown energy repulses them. Thor then brings Jane to Asgard to find out what happened to her. When the energy is released again, they discover that when Jane disappeared, she crossed paths with the Aether and it entered her. Malekith, upon sensing that the time to strike is now, seeks out the Aether. He attacks Asgard and Thor's mother Frigga (Rene Russo) is killed protecting Jane. Odin wants to keep Jane on Asgard so that Malekith will come. Thor disagrees with his plan, so with his cohorts, he decides to take Jane away. He enlists the aid of his brother, Loki (Tom Hiddleston). Unfortunately, Loki's motivations remain unknown.",
        "chronologicalIndex": "9",
        "phase": "Two"
    },
    {
        "poster": "poster_captain_america_the_winter_soldier",
        "title": "Captain America: The Winter Soldier",
        "year": "2014",
        "details": "PG-13 | 2h 16min | Action, Adventure, Sci-Fi | ",
        "date": "4 April 2014",
        "director": "Anthony Russo & Joe Russo",
        "stars": "Chris Evans, Samuel L. Jackson, Scarlett Johansson, Sebastian Stan, Anthony Mackie, Robert Redford",
        "synopsis": "For Steve Rogers, awakening after decades of suspended animation involves more than catching up on pop culture; it also means that this old school idealist must face a world of subtler threats and difficult moral complexities. That becomes clear when Director Nick Fury is killed by the mysterious assassin, the Winter Soldier, but not before warning Rogers that SHIELD has been subverted by its enemies. When Rogers acts on Fury's warning to trust no one there, he is branded as a traitor by the organization. Now a fugitive, Captain America must get to the bottom of this deadly mystery with the help of the Black Widow and his new friend, The Falcon. However, the battle will be costly for the Sentinel of Liberty, with Rogers finding enemies where he least expects them while learning that the Winter Soldier looks disturbingly familiar.",
        "chronologicalIndex": "10",
        "phase": "Two"
    },
    {
        "poster": "poster_guardians_of_the_galaxy",
        "title": "Guardians of the Galaxy",
        "year": "2014",
        "details": "PG-13 | 2h 1min | Action, Adventure, Comedy | ",
        "date": "1 August 2014",
        "director": "James Gunn",
        "stars": "Chris Pratt, Zoe Saldana, Vin Diesel, Bradley Cooper, Michael Rooker, Karen Gillan, Lee Pace",
        "synopsis": "After stealing a mysterious orb in the far reaches of outer space, Peter Quill from Earth is now the main target of a manhunt led by the villain known as Ronan the Accuser. To help fight Ronan and his team and save the galaxy from his power, Quill creates a team of space heroes known as the \"Guardians of the Galaxy\" to save the galaxy.",
        "chronologicalIndex": "11",
        "phase": "Two"
    },
    {
        "poster": "poster_avengers_age_of_ultron",
        "title": "Avengers: Age of Ultron",
        "year": "2015",
        "details": "PG-13 | 2h 21min | Action, Adventure, Sci-Fi | ",
        "date": "1 May 2015",
        "director": "Joss Whedon",
        "stars": "Robert Downey Jr., Chris Evans, Mark Ruffalo, Chris Hemsworth, Scarlett Johansson, Mark Ruffalo, Jeremy Renner, Samuel L. Jackson, James SpaderElizabeth Olsen, Aaron Taylor-Johnson",
        "synopsis": "Tony Stark creates the Ultron Program to protect the world, but when the peacekeeping program becomes hostile, The Avengers go into action to try and defeat a virtually impossible enemy together. Earth's mightiest heroes must come together once again to protect the world from global extinction.",
        "chronologicalIndex": "13",
        "phase": "Two"
    },
    {
        "poster": "poster_ant_man",
        "title": "Ant-Man",
        "year": "2015",
        "details": "PG-13 | 1h 57min | Action, Adventure, Comedy | ",
        "date": "6 May 2016",
        "director": "Peyton Reed",
        "stars": "Paul Rudd, Michael Douglas, Evangeline Lilly, Corey Stoll, Michael Peña",
        "synopsis": "Armed with the astonishing ability to shrink in scale but increase in strength, con-man Scott Lang must embrace his inner-hero and help his mentor, Dr. Hank Pym, protect the secret behind his spectacular Ant-Man suit from a new generation of towering threats. Against seemingly insurmountable obstacles, Pym and Lang must plan and pull off a heist that will save the world.",
        "chronologicalIndex": "14",
        "phase": "Two"
    },
    {
        "poster": "poster_captain_america_civil_war",
        "title": "Captain America: Civil War",
        "year": "2016",
        "details": "PG-13 | 2h 27min | Action, Adventure, Sci-Fi | ",
        "date": "6 May 2016",
        "director": "Anthony Russo & Joe Russo",
        "stars": "Chris Evans, Robert Downey Jr., Scarlett Johansson, Sebastian Stan, Anthony Mackie, Don Cheadle, Jeremy Renner, Chadwick Boseman, Paul Bettany, Elizabeth Olsen, Paul Rudd, Tom Holland, Daniel Brühl",
        "synopsis": "With many people fearing the actions of super heroes, the government decides to push for the Hero Registration Act, a law that limits a hero's actions. This results in a division in The Avengers. Iron Man stands with this Act, claiming that their actions must be kept in check otherwise cities will continue to be destroyed, but Captain America feels that saving the world is daring enough and that they cannot rely on the government to protect the world. This escalates into an all-out war between Team Iron Man (Iron Man, Black Panther, Vision, Black Widow, War Machine, and Spider-Man) and Team Captain America (Captain America, Bucky Barnes, Falcon, Scarlet Witch, Hawkeye, and Ant Man) while a new villain emerges.",
        "chronologicalIndex": "15",
        "phase": "Three"
    },
    {
        "poster": "poster_doctor_strange",
        "title": "Doctor Strange",
        "year": "2016",
        "details": "PG-13 | 1h 55min | Action, Adventure, Fantasy | ",
        "date": "4 November 2016",
        "director": "Scott Derrickson",
        "stars": "Benedict Cumberbatch, Chiwetel Ejiofor, Rachel McAdams, Benedict Wong, Mads Mikkelsen, Tilda Swinton",
        "synopsis": "Marvel's \"Doctor Strange\" follows the story of the talented neurosurgeon Doctor Stephen Strange who, after a tragic car accident, must put ego aside and learn the secrets of a hidden world of mysticism and alternate dimensions. Based in New York City's Greenwich Village, Doctor Strange must act as an intermediary between the real world and what lies beyond, utilising a vast array of metaphysical abilities and artifacts to protect the Marvel Cinematic Universe.",
        "chronologicalIndex": "18",
        "phase": "Three"
    },
    {
        "poster": "poster_guardians_of_the_galaxy_vol_2",
        "title": "Guardians of the Galaxy Vol. 2",
        "year": "2017",
        "details": "PG-13 | 2h 16min | Action, Adventure, Comedy | ",
        "date": "5 May 2017",
        "director": "James Gunn",
        "stars": "Chris Pratt, Zoe Saldana, Vin Diesel, Bradley Cooper, Michael Rooker, Karen Gillan, Pom Klementieff, Kurt Russell",
        "synopsis": "After saving Xandar from Ronan's wrath, the Guardians are now recognized as heroes. Now the team must help their leader Star Lord (Chris Pratt) uncover the truth behind his true heritage. Along the way, old foes turn to allies and betrayal is blooming. And the Guardians find that they are up against a devastating new menace who is out to rule the galaxy.",
        "chronologicalIndex": "12",
        "phase": "Three"
    },
    {
        "poster": "poster_spider_man_homecoming",
        "title": "Spider-Man: Homecoming",
        "year": "2017",
        "details": "PG-13 | 2h 13min | Action, Adventure, Sci-Fi | ",
        "date": "7 July 2017",
        "director": "Jon Watts",
        "stars": "Tom Holland, Michael Keaton, Robert Downey Jr., Jacob Batalon, Zendaya",
        "synopsis": "Thrilled by his experience with the Avengers, Peter returns home, where he lives with his Aunt May, under the watchful eye of his new mentor Tony Stark, Peter tries to fall back into his normal daily routine - distracted by thoughts of proving himself to be more than just your friendly neighborhood Spider-Man - but when the Vulture emerges as a new villain, everything that Peter holds most important will be threatened.",
        "chronologicalIndex": "16",
        "phase": "Three"
    },
    {
        "poster": "poster_thor_ragnarok",
        "title": "Thor: Ragnarok",
        "year": "2017",
        "details": "PG-13 | 2h 10min | Action, Adventure, Comedy | ",
        "date": "3 November 2017",
        "director": "Taika Waititi",
        "stars": "Chris Hemsworth, Tom Hiddleston, Cate Blanchett, Mark Ruffalo, Tessa Thompson, Jeff Goldblum, Taika Waititi, Karl Urban, Idris Elba, Benedict Cumberbatch, Anthony Hopkins",
        "synopsis": "Imprisoned on the other side of the universe, the mighty Thor (Chris Hemsworth) finds himself in a deadly gladiatorial contest that pits him against The Incredible Hulk (Mark Ruffalo), his former ally and fellow Avenger. Thor's quest for survival leads him in a race against time to prevent the all-powerful Hela (Cate Blanchett) from destroying his home world and the Asgardian civilization.",
        "chronologicalIndex": "19",
        "phase": "Three"
    },
    {
        "poster": "poster_black_panther",
        "title": "Black Panther",
        "year": "2018",
        "details": "PG-13 | 2h 14min | Action, Adventure, Sci-Fi | ",
        "date": "16 February 2018",
        "director": "Ryan Coogler",
        "stars": "Chadwick Boseman, Michael B. Jordan, Lupita Nyong'o, Danai Gurira, Letitia Wright, Martin Freeman, Winston Duke, Angela Bassett, Forest Whitaker, Andy Serkis, Daniel Kaluuya",
        "synopsis": "After the events of Captain America: Civil War, Prince T'Challa returns home to the reclusive, technologically advanced African nation of Wakanda to serve as his country's new king. However, T'Challa soon finds that he is challenged for the throne from factions within his own country. When two foes conspire to destroy Wakanda, the hero known as Black Panther must team up with C.I.A. agent Everett K. Ross and members of the Dora Milaje, Wakandan special forces, to prevent Wakanda from being dragged into a world war.",
        "chronologicalIndex": "17",
        "phase": "Three"
    },
    {
        "poster": "poster_avengers_infinity_war_thanos",
        "title": "Avengers: Infinity War",
        "year": "2018",
        "details": "PG-13 | 2h 29min | Action, Adventure, Sci-Fi | ",
        "date": "27 April 2018",
        "director": "Anthony Russo & Joe Russo",
        "stars": "Josh Brolin, Robert Downey Jr., Chris Hemsworth, Mark Ruffalo, Benedict Cumberbatch, Tom Holland, Chris Pratt, Zoe Saldana, Chris Evans, Scarlett Johansson, Chadwick Boseman, Paul Bettany, Elizabeth Olsen, Tom Hiddleston, Anthony Mackie, Don Cheadle, Vin Diesel, Karen Gillan, Bradley Cooper, Dave Bautista, Pom Klementieff",
        "synopsis": "As the Avengers and their allies have continued to protect the world from threats too large for any one hero to handle, a new danger has emerged from the cosmic shadows: Thanos. A despot of intergalactic infamy, his goal is to collect all six Infinity Stones, artifacts of unimaginable power, and use them to inflict his twisted will on all of reality. Everything the Avengers have fought for has led up to this moment, the fate of Earth and existence has never been more uncertain.",
        "chronologicalIndex": "21",
        "phase": "Three"
    },
    {
        "poster": "poster_ant_man_and_the_wasp",
        "title": "Ant-Man and the Wasp",
        "year": "2018",
        "details": "PG-13 | 1h 58min | Action, Adventure, Comedy | ",
        "date": "6 July 2018",
        "director": "Peyton Reed",
        "stars": "Paul Rudd, Evangeline Lilly, Michael Douglas, Michael Peña, Hannah John-Kamen, Walton Goggins, Laurence Fishburne, Michelle Pfeiffer",
        "synopsis": "In the aftermath of Captain America: Civil War (2016), Scott Lang grapples with the consequences of his choices as both a superhero and a father. As he struggles to rebalance his home life with his responsibilities as Ant-Man, he's confronted by Hope van Dyne and Dr. Hank Pym with an urgent new mission. Scott must once again put on the suit and learn to fight alongside The Wasp as the team works together to uncover secrets from their past.",
        "chronologicalIndex": "20",
        "phase": "Three"
    },
    {
        "poster": "poster_captain_marvel",
        "title": "Captain Marvel",
        "year": "2019",
        "details": "PG-13 | 2h 3min | Action, Adventure, Sci-Fi | ",
        "date": "8 March 2019",
        "director": "Anna Boden & Ryan Fleck",
        "stars": "Brie Larson, Samuel L. Jackson, Lashana Lynch, Ben Mendelsohn, Jude Law, Annette Bening, Gemma Chan, Djimon Hounsou",
        "synopsis": "After crashing an experimental aircraft, Air Force pilot Carol Danvers is discovered by the Kree and trained as a member of the elite Starforce Military under the command of her mentor Yon-Rogg. Six years later, after escaping to Earth while under attack by the Skrulls, Danvers begins to discover there's more to her past. With help from S.H.I.E.L.D. agent Nick Fury, they set out to unravel the truth.",
        "chronologicalIndex": "2",
        "phase": "Three"
    },
    {
        "poster": "poster_avengers_endgame",
        "title": "Avengers: Endgame",
        "year": "2019",
        "details": "PG-13 | 3h 1min | Action, Adventure, Drama | ",
        "date": "26 April 2019",
        "director": "Anthony Russo & Joe Russo",
        "stars": "Robert Downey Jr., Chris Hemsworth, Mark Ruffalo, Chris Evans, Scarlett Johansson, Jeremy Renner, Don Cheadle, Karen Gillan, Josh Brolin, Brie Larson, Tessa Thompson, Danai Gurira, Tilda Swinton, John Slattery, Elizabeth Olsen, Benedict Cumberbatch, Tom Holland, Chris Pratt, Zoe Saldana, Anthony Mackie, Chadwick Boseman, Vin Diesel, Bradley Cooper, Dave Bautista, Pom Klementieff, Samuel L. Jackson, Taika Waititi",
        "synopsis": "After the devastating events of Avengers: Infinity War (2018), the universe is in ruins due to the efforts of the Mad Titan, Thanos. With the help of remaining allies, the Avengers must assemble once more in order to undo Thanos's actions and undo the chaos to the universe, no matter what consequences may be in store, and no matter who they face...\n\nThe grave course of events set in motion by Thanos, that wiped out half the universe and fractured the Avengers ranks, compels the remaining Avengers to take one final stand in Marvel Studios' grand conclusion to twenty-two films - Avengers: Endgame.\n\nAfter half of all life is snapped away by Thanos, the Avengers are left scattered and divided. Now with a way to reverse the damage, the Avengers and their allies must assemble once more and learn to put differences aside in order to work together and set things right. Along the way, the Avengers realize that sacrifices must be made as they prepare for the ultimate final showdown with Thanos, which will result in the heroes fighting the biggest battle they have ever faced.",
        "chronologicalIndex": "22",
        "phase": "Three"
    },
    {
        "poster": "poster_spider_man_far_from_home",
        "title": "Spider-Man: Far from Home",
        "year": "2019",
        "details": "PG-13 | 2h 9min | Action, Adventure, Sci-Fi | ",
        "date": "2 July 2019",
        "director": "Jon Watts",
        "stars": "Tom Holland, Samuel L. Jackson, Jake Gyllenhaal, Zendaya, Jacob Batalon, Jon Favreau, Marisa Tomei, Tony Revolori, Cobie Smulders",
        "synopsis": "Our friendly neighborhood Super Hero decides to join his best friends Ned, MJ, and the rest of the gang on a European vacation. However, Peter's plan to leave super heroics behind for a few weeks are quickly scrapped when he begrudgingly agrees to help Nick Fury uncover the mystery of several elemental creature attacks, creating havoc across the continent.",
        "chronologicalIndex": "23",
        "phase": "Three"
    }
]